<template>
    <div id="help-area" class="area-panel">
        <h2>使い方</h2>
        <div class="box-detail">
            <h3>テキストデータからSQLを作成する</h3>
            <div class="box-text">
                <ol>
                    <li>[設定情報]で、区切り文字や文字コードを設定します。</li>
                    <li>[テーブル名]に、テーブル名を入力します。</li>
                    <li>[更新情報]・[テーブル情報]に、カンマやタブ区切りのテキストデータを入力します。</li>
                    <li>SQLのボタンをクリックし、SQLを作成します。</li>
                </ol>
                <p>[更新情報]は、UPDATE文を作成時にSET句として使用します。</p>
                <p>[テーブル情報]は、SELECT文・DELETE文・UPDATE文を作成時にWHERE句として、INSERT文を作成時にVALUES句として使用します。</p>
                <p>[更新情報]・[テーブル情報]の先頭行をフィールド名として使用します。</p>
            </div>
        </div>
        <div class="box-detail">
            <h3>ファイルからSQLを作成する</h3>
            <div class="box-text">
                <ol>
                    <li>[設定情報]で、区切り文字や文字コードを設定します。</li>
                    <li>[ファイル選択]からcsvファイルを選択します(複数選択可)。</li>
                    <li>SQLのボタンをクリックし、SQLを作成します。</li>
                    <li>ファイル選択ボタンをクリックし、ファイルを作成します。</li>
                </ol>
                <p>ファイル名には、半角英字（a-z A-Z）、半角数字（0-9）、ダッシュ（-）、アンダースコア（_）を使用できます。</p>
                <p>テーブル名には、ファイル名を使用します。</p>
                <p>フィールド名には、ファイルの先頭行を使用します。</p>
                <p>SET句には、ファイルの2行目を使用します（Update文作成時）。</p>
            </div>
        </div>
    </div>
</template>
