<template>
  <div>
    <h2 class="h5 mb-4">使い方</h2>
    <section class="mb-4">
      <h3 class="h5 font-weight-bold">テキストからSQLを作成する</h3>
      <ol>
        <li>[設定情報]で、区切り文字や文字コードを設定します。</li>
        <li>[テーブル名]に、テーブル名を入力します。</li>
        <li>[更新情報]・[テーブル情報]に、カンマやタブ区切りのテキストデータを入力します。</li>
        <li>SQLのボタンをクリックし、SQLを作成します。</li>
      </ol>
      <p>
        [更新情報]は、UPDATE文を作成時にSET句として使用します。<br>
        [テーブル情報]は、SELECT文・DELETE文・UPDATE文を作成時にWHERE句として、INSERT文を作成時にVALUES句として使用します。<br>
        [更新情報]・[テーブル情報]の先頭行をフィールド名として使用します。
      </p>
    </section>
    <section>
      <h3 class="h5 font-weight-bold">ファイルからSQLを作成する</h3>
      <ol>
        <li>[設定情報]で、区切り文字や文字コードを設定します。</li>
        <li>[ファイル選択]からcsvファイルを選択します(複数選択可)。</li>
        <li>SQLのボタンをクリックし、SQLを作成します。</li>
        <li>ファイル選択ボタンをクリックし、ファイルを作成します。</li>
      </ol>
      <p>
        ファイル名には、半角英字（a-z A-Z）、半角数字（0-9）、ダッシュ（-）、アンダースコア（_）を使用できます。<br>
        テーブル名には、ファイル名を使用します。<br>
        フィールド名には、ファイルの先頭行を使用します。<br>
        SET句には、ファイルの2行目を使用します（Update文作成時）。
      </p>
    </section>
  </div>
</template>
